package com.mmgct.quitguide2.fragments;

import android.os.Bundle;
import android.support.annotation.Nullable;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.webkit.WebView;

import com.mmgct.quitguide2.R;
import com.mmgct.quitguide2.utils.Common;

/**
 * Created by 35527 on 11/5/2015.
 */
public class WebviewFragment extends BaseFragment {
    private static final String TAG = "WebviewFragment";
    public static final String URL_KEY = "url";
    private View rootView;
    private String mUrl;


    @Nullable
    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container, Bundle savedInstanceState) {
        rootView = inflater.inflate(R.layout.fragment_webview, null, false);

        WebView webView = (WebView) rootView.findViewById(R.id.plot_web_view);

        Bundle args = getArguments();
        if (args != null && args.containsKey(URL_KEY)) {
            mUrl = args.getString(URL_KEY);
        }

        // Settings
        webView.getSettings().setAllowUniversalAccessFromFileURLs(true);
        webView.getSettings().setAllowFileAccessFromFileURLs(true);
        webView.getSettings().setJavaScriptEnabled(true);
        webView.getSettings().setDefaultTextEncodingName("UTF-8");
        if (mUrl != null) {
//            String html = Common.assetFileToString(mUrl, getActivity());
            String html = WEB_HTML;
            webView.loadData(html, "text/html; charset=utf-8", "UTF-8");
            webView.loadDataWithBaseURL("file:///android_asset/", html, "text/html; charset=utf-8", "UTF-8", null);
        }
        webView.setBackgroundColor(getResources().getColor(R.color.transparent));

        return rootView;
    }


    private static final String WEB_HTML = "<html lang=\"en\">\n" +
            "<head>\n" +
            "<meta http-equiv=\"Content-Type\"\n" +
            "      content=\"text/html\"; charset=\"UTF-8\">\n" +
            "<title>Guide to Quiting</title>\n" +
            "<link rel=\"stylesheet\" href=\"bootstrap-3.0.3.css\">\n" +
            "<link rel=\"stylesheet\" href=\"bootstrap-theme-3.0.3.css\">\n" +
            "<script type=\"text/javascript\" src=\"jquery.js\"></script>\n" +
            "<script src=\"bootstrap-3.0.3.js\"></script>\n" +
            "<style type=\"text/css\">\n" +
            "    .bs-example{\n" +
            "    \tmargin: 0px;\n" +
            "    }\n" +
            "\n" +
            "</style>\n" +
            "</head>\n" +
            "<body style=\"background-color: transparent;\">\n" +
            "<div class=\"bs-example\">\n" +
            "    <div class=\"panel-group\" id=\"accordion\">\n" +
            "  <div class=\"panel panel-default\">\n" +
            "    <div class=\"panel-heading\">\n" +
            "      <h4 class=\"panel-title\">\n" +
            "        <a data-toggle=\"collapse\" data-parent=\"#accordion\" href=\"#collapseOne\">1. მოსამზადებელი ნაბიჯები:</a>\n" +
            "      </h4>\n" +
            "    </div>\n" +
            "    <div id=\"collapseOne\" class=\"panel-collapse collapse\">\n" +
            "      <div class=\"panel-body\">\n" +
            "          <p> მიხვდი, რომ მოწევის შეწყვეტა ძნელია. უმჯობესია, თუ ამისთვის წინასწარ მოემზადები. როდესაც იგრძნობ, რომ მზად ხართ შეწყვიტო მოწევა, <span class=\"caps\">დაიწყე</span> შემდეგი ხუთი პუნქტის განხორციელება:</p>\n" +
            "          \n" +
            "          <h2>1. დათქვი მოწევის შეწყვეტის თარიღი</h2>\n" +
            "          \n" +
            "          <p>მოწევის შესაწყვეტად შეარჩიე თარიღი მომდევნო ორი კვირის განმავლობაში, რაც საკმარის დროს მოგცემს მოსამზადებლად. სერიოზულად დაფიქრდი თარიღის შესახებ. ნუ აირჩევ ისეთ დღეს, როდესაც იცი, რომ დაკავებული, დაძაბული იქნები ან როდესაც ცდუნებაზე უარის თქმა ძნელი იქნება (მაგალითად, მეგობრებთან ერთად გატარებული საღამო; ისეთი დღეები, როდესაც სამსახურში მოწევა შესაძლებელია).</p>\n" +
            "          \n" +
            "          <h2>2. აცნობე ოჯახის წევრებს და მეგობრებს, რომ გადაწყვიტე მოწევის შეწყვეტა</h2>\n" +
            "          \n" +
            "          <p>მოწევის შეწყვეტა უფრო ადვილია, როდესაც გარშემო მყოფნი მხარს გიჭერენ. აცნობე, რომ მოწევის შეწყვეტა გადაწყვიტე და აუხსენი, თუ როგორ შეუძლიათ შენი დახმარება. ყოველ ჩვენთაგანს განსხვავებული საჭიროებები აქვს, კარგად აუხსენი მეგობრებს და ოჯახის წევრებს რა გჭირდება. არ იცი რა გჭირდება? შეგიძლია <span class=\"caps\">დაიწყო</span> საუბარი:</p>\n" +
            "          \n" +
            "          <ul>\n" +
            "              <li>დაელაპარაკე ოჯახის წევრებს და მეგობრებს<a href=\"http://smokefree.gov/reasons-to-quit\">მოწევის შეწყვეტის მიზეზებზე </a>.</li>\n" +
            "              <li>სთხოვე ოჯახის წევრებს და მეგობრებს შენთან ერთად დააკვირდნენ პროცესის მიმდინარეობას. </li>\n" +
            "              <li>აღნიშნე <a href=\"http://smokefree.gov/cravings\">რის გამო ეწევი</a>,  და თხოვე მეგობრებს და ოჯახს დაგეხმარონ მათთან გამკლავებაში. </li>\n" +
            "              <li>სთხოვე მეგობრებს და ოჯახის წევრებს თქვენთვის თამბაქოსგან თავისუფალი საქმიანობის მოფიქრება (მაგ. კინოში ერთად წასვლა)</li>\n" +
            "              <li>გყავს მეგობარი ან ოჯახის წევრი, რომელიც ეწევა? თხოვე შეწყვიტოს მოწევა ან თავი შეიკავოს და შენთან ყოფნის დროს არ მოწიოს</li>\n" +
            "              <li>მოწევის სურვილი აუცილებლად გექნება. თხოვე მეგობრებს და ოჯახის წევრებს, რადაც არ უნდა დაუჯდეთ, სიგარეტის შოვნაში შეგიშალონ ხელი. </li>\n" +
            "              <li>გააფრთხილე მეგობრები და ოჯახის წევრები, რომ მოწევის შეწყვეტის პერიოდში უხასიათოდ იქნები; თხოვე, მოთმინება გამოიჩინონ და ხელი შეგიწყონ.</li>\n" +
            "              <li>იღებ რაიმე მედიკამენტს? შეატყობინე პირად ექიმს ან ფარმაცევტს, რომ აპირებ შეწყვიტო მოწევა. შესაძლოა დანიშნულების შეცვლა დაგჭირდეს.\n" +
            "              </li>\n" +
            "          </ul>\n" +
            "          \n" +
            "          <p>მხარდაჭერა მოწევის წარმატებით შეწყვეტის ერთ-ერთი მნიშვნელოვანი ასპექტია. გაარკვიე ,\n" +
            "              <a href=\"http://smokefree.gov/talk-to-an-expert\">სხვა მხარდამჭერი საშუალებები</a> რომ დაგეხმაროს მოწევისთვის თავის დანებებაში</p>\n" +
            "          \n" +
            "          <h2>3.წინასწარ გაითვალისწინეთ და შესაბამისად დაგეგმე მოწევის შეწყვეტის დროს როგორ უნდა გადალახო სირთულეები</h2>\n" +
            "          \n" +
            "          <p>მოწევის შეწყვეტა ყველაზე რთული დასწყისშია. გექნება უსიამოვნო შეგრძნებები, მოწევის ჟინი, თამბაქოს მიტოვებით გამოწვეული სიმპტომები და სიგარეტის მოკიდების სურვილი. მოწევის შეწყვეტისათვის მზად რომ იყო, მნიშვნელოვანია ამ სირთულეებისათვის მომზადება. <span class=\"caps\">როდესაც დაიწყებ</span>, გაითვალისწინე შემდეგი:</p>\n" +
            "          \n" +
            "          <h3>უსიამოვნო შეგრძნებები</h3>\n" +
            "          \n" +
            "          <p>მოწევის შეწყვეტიდან რამდენიმე კვირის განმავლობაში ხშირია უსიამოვნო შეგრძნებები და სიგარეტის მოწევის დიდი სურვილი. ამას იწვევს თამბაქოს მიტოვება, ანუ პერიოდი, როდესაც ორგანიზმი ეჩვევა ნიკოტინის გარეშე არსებობას. ნიკოტინი ქიმიური ნივთიერებაა, რომელსაც შეიცავს სიგარეტი და რომელიც იწვევს დამოკიდებულებას. სხვა სიმპტომებია:</p>\n" +
            "          \n" +
            "          <ul>\n" +
            "              <li>უხალისოდ ყოფნა, დეპრესია</li>\n" +
            "              <li>უძილობა</li>\n" +
            "              <li> გაღიზიანებულობა, სიბრაზე</li>\n" +
            "              <li>მოუსვენრობა,  აღგზნებულობა ან შფოთვა</li>\n" +
            "              <li>ნათლად მსჯელობის, ფიქრის პრობლემები</li>\n" +
            "          </ul>\n" +
            "          \n" +
            "          <p>შესაძლებელია ამ შეგრძნებებისგან თავის დასაღწევად გაგიჩნდეს მოწევის სურვილი. გახსოვდეს, რომ ეს შეგრძნებები დროებითია, მიუხედავად იმისა, თუ რამდენად ძლიერად გეჩვენება.  </p>\n" +
            "          \n" +
            "          <h3>მოწევის მაპროვოცირებელი მიზეზები</h3>\n" +
            "          \n" +
            "          <p>მოწევის პროვოცირება შეიძლება გამოიწვიოს გარკვეულმა ადამიანებმა, ადგილებმა ან საქმიანობამ. აუცილებელია მათი გაანალიზება, რათა მათთან გამკლავება შეძლო.</p>\n" +
            "          \n" +
            "          <h3>დამოკიდებულება, ძლიერი სურვილი</h3>\n" +
            "          \n" +
            "          <p>ძლიერი სურვილი ხანმოკლე, მაგრამ ინტენსიურია. როგორც წესი, იგი გრძელდება მხოლოდ რამდენიმე წუთი. წინასწარ მოიფიქრე და დაგეგმე რას გააკეთებ მოწევის ძლიერი სურვილის დროს.</p>\n" +
            "          \n" +
            "          <h2>4. მოაშორთ სიგარეტი და თამბაქოსთან დაკავშირებული ყველა ნივთი სახლიდან, მანქანიდან და სამსახურიდან</h2>\n" +
            "          \n" +
            "          <p>შეწყვეტის პერიოდში მოწევის სურვილი გექნება. გაუძელი; შენ ძლიერი ხარ! მოიშორე ის ნივთები, რაც თქვენში მოწევის სურვილს ბადებს. გაითვალისწინე შემდეგი რჩევები:</p>\n" +
            "          \n" +
            "          <ul>\n" +
            "              <li>გადააგდე სიგარეტი და ასანთი, სანთებელა და საფერფლე. არ დაგავიწყდეს მანქანის საფერფლე და სანთებელა!</li>\n" +
            "              <li>ნუ შეინახავ სიგარეტის კოლოფს \"ყოველი შემთხვევისათვის. სიგარეტის კოლოფის შენახვა ხელს უწყობს მოწევის ხელახლა დაწყებას.</li>\n" +
            "              <li>უნდა მოიშორო სიგარეტის სუნი. გაასუფთავე და განაახლე ნივთები სახლში, მანქანაში, სამსახურში. მოწევის შეწყვეტა გაგიადვილდება, თუ სიგარეტის სუნს არ იგრძნობ.</li>\n" +
            "              <li>მოიშორე თამბაქოს ლაქები კბილებიდან. როდესაც სიგარეტის მოწევას შეწყვეტ, ყოველთვის სუფთა კბილები გექნება.</li>\n" +
            "          </ul>\n" +
            "          \n" +
            "          <h3>ნუ გამოიყენებ თამბაქოს სხვა პროდუქტს</h3>\n" +
            "          \n" +
            "          <p>სიგარეტის ნაცვლად თამბაქოს სხვა ნაწარმის გამოყენებაზე ფიქრობ? კარგად დაფიქრდი. თამბაქოს შემცველი ყველა ნაწარმი შეიცავს ქიმიურ ნივთიერებებს და საწამლავს. სახელის, ნიკოტინის ან კუპრის დაბალი შემცველობის მიუხედავად, ისინი ისევე საზიანო არიან, როგორც სიგარეტი. უკვამლო თამბაქო‚ ჩიბუხი‚ სიგარა‚ სიგარილო‚ ყალიონი, ჩილიმი, ელექტრონული სიგარეტი ასევე ვნებს ჯანმრთელობას.</p>\n" +
            "          \n" +
            "          <p>რეკლამების მიუხედავად, თამბაქოს შემცველი ყველა პროდუქტი საზიანოა.</p>\n" +
            "          \n" +
            "          <h2>5. გაესაუბრე ექიმს ან ფარმაცევტს თამბაქოზე დამოკიდებულების მკურნალობის საშუალებებზე</h2>\n" +
            "          \n" +
            "          <p>მოწევის შეწყვეტა რთულია და მისი უცაბედი შეწყვეტა არ არის ერთადერთი გამოსავალი. გაესაუბრე ექიმს ან ფარმაცევტს თამბაქოზე დამოკიდებულების მკურნალობის საშუალებებზე. ექიმების და ფარმაცევტების უმრავლესობას შესწევს უნარი გიპასუხონ შეკითხვებზე, მოგაწოდონ ინფორმაცია და მიგანიშნონ შესაბამისი დაწესებულებები, სადაც დაგეხმარებიან. </p>\n" +
            "          \n" +
            "          <p>თამბაქოზე დამოკიდებულების მკურნალობის მედიკამენტები, მათ შორის პლასტირი, საღეჭი რეზინი, ტაბლეტები და სხვ. ეფექტური საშუალებაა. მედიკამენტების გამოყენებამდე გაეცანი ინსტრუქციებს. თუ რაიმე შეკითხვა გაქვს, მიმართე ექიმს ან ფარმაცევტს. თუ ორსულად ხარ ან დაორსულებას აპირებ,  გაესაუბრე ექიმს ნებისმიერი სახის მედიკამენტის გამოყენებამდე. თუ თამბაქოზე დამოკიდებულების მკურნალობის მედიკამენტის გამოყენება გაქვს გადაწყვეტილი, არ დაგავიწყდეს მისი შეძენა დათქმული თარიღისათვის. </p>\n" +
            "          \n" +
            "          <p>თუ სასწრაფოდ გესაჭიროება დახმარება, შეგიძლია ტელეფონით გაესაუბრო კონსულტანტს - 116001.</p>\n" +
            "      </div>\n" +
            "    </div>\n" +
            "  </div>\n" +
            "  <div class=\"panel panel-default\">\n" +
            "    <div class=\"panel-heading\">\n" +
            "      <h4 class=\"panel-title\">\n" +
            "        <a data-toggle=\"collapse\" data-parent=\"#accordion\" href=\"#collapseTwo\">2. მოწევის ძლიერი სურვილი:</a>\n" +
            "      </h4>\n" +
            "    </div>\n" +
            "    <div id=\"collapseTwo\" class=\"panel-collapse collapse\">\n" +
            "      <div class=\"panel-body\">\n" +
            "          <p>მოწევის ძლიერი სურვილი ჩნდება და ქრება. გარკვეულ პიროვნებები, ადგილები და სიტუაციები ხელს უწყობენ მოწევის სურვილის გაჩენას. როგორ აპირებ ამ მომენტებთან გამკლავებას?</p>\n" +
            "          \n" +
            "          <h2>დაადგინე მაპროვოცირებელი მიზეზები</h2>\n" +
            "          <p>ამ მიზეზების ამოცნობა ხელს შეგიწყობს მათ კონტროლში. თავდაპირველად, მათი მთლიანად თავიდან არიდება მოგინდება; შემდეგ, მათ დასაძლევად შეიძლება იპოვო სხვა გზები. ქვემოთ ჩამოთვლილია მოწევის მაპროვიცირებელი მიზეზები:</p>\n" +
            "          <ul>\n" +
            "              <li>სტრესი/დაძაბულობა</li>\n" +
            "              <li>მოწყენილობა</li>\n" +
            "              <li>ტელეფონზე საუბარი</li>\n" +
            "              <li>ალკოჰოლის მიღება</li>\n" +
            "              <li>ტელევიზორის ყურება</li>\n" +
            "              <li>ავტომობილის მართვა</li>\n" +
            "              <li>საკვების მიღება</li>\n" +
            "              <li>შესვენება სამსახურში</li>\n" +
            "              <li>კაფე/რესტორანი/ბარში ყოფნა</li>\n" +
            "              <li>სხვა მწეველების დანახვა</li>\n" +
            "              <li>დაწყნარება ჩხუბის შემდეგ </li>\n" +
            "              <li>მარტოსულობა</li>\n" +
            "              <li>სექსის შემდეგ </li>\n" +
            "              <li>ყავის სმა</li>\n" +
            "          </ul>\n" +
            "          <h2>დაგეგმე, როგორ გაუმკლავდები მოწევის ძლიერ სურვილს.</h2>\n" +
            "          <p>მოწევის ძლიერი სურვილი 5-10 წთ-ის განმავლობაში გრძელდება. ეს უსასიამოვნო შეგრძნებაა, მაგრამ დაელოდე მის დასასრულს. ჩამოწერე, რითი შეგიძლია დაკავდეთ, რათა ყურადღება გადაიტანო:</p>\n" +
            "          <ul>\n" +
            "              <li>დაურეკე ან ტექსტური შეტყობინება გაუგზავნე ვინმეს. ნუ იქნებით მარტო ამ სიტუაციაში, დაიხმარე სხვებიც. ან დაუკავშირდი ცხელ ხაზს - 116001</li>\n" +
            "              <li>მოითმინეთ 15 წუთი. წაიკითხე ჟურნალი, მოუსმინე მუსიკას ან ითამაშე საყვარელი თამაში 15 წუთის განმავლობაში. სურვილი რამდენიმე წუთში გაქრება!</li>\n" +
            "              <li>გაისეირნე. არ გაქვთ საკმარისი დრო? კიბეზე ჩაირბინე და ამოირბინე რამდენჯერმე. ფიზიკური დატვირთვა, სულ მცირეოდენიც კი, ხელს უწყობს ენერგიის მატებას და მოწევის სურვილის გაქრობას.</li>\n" +
            "              <li>იფიქრეთ თამბაქოსთვის თავის დანებების მიზეზზე. იმის გაანალიზება, თუ რატომ გსურს იყო თამბაქოსგან თავისუფალი გაადვილებს მოწევის სურვილის დაძლევას.</li>\n" +
            "              <li>ეწვიე ადგილებს, სადაც არ ეწევიან; ადგილებს, სადაც მოწევა აკრძალულია. რიგ საზოგადო ადგილებში მოწევა აკრძალულია. წადი კინოში, მაღაზიაში ან სხვა ადგილას, სადაც იძულებული იქნები არ მოწიო.</li>\n" +
            "              <li>დათვალე ხარჯები. სიგარეტი ძვირია. დათვალე, რამდენს ზოგავ და გადაწყვიტე რისი შეძენა გსურს ამ დანაზოგით. </li>\n" +
            "              <li>სიგარეტის ნაცვლად დაღეჭე საღეჭი რეზინა ან თან იქონიე მაგარი კამფეტი. კარგად მოქმედებს წყლის სმაც!</li>\n" +
            "              <li>გადაიტანე ყურადღება სხვა რაიმეზე. როდესაც მოწევის ძლიერი სურვილი გიჩნდება, შეწყვიტე, რასაც აკეთებ და დაიწყე სხვა საქმიანობა. რუტინული საქმიანობის შეცვლა ხშირად უწყობს ხელს მოწევის სურვილის გაქრობას.</li>\n" +
            "              <li>ღრმად ჩაისუნთქე და ამოისუნთქე. გაიმეორე 10-ჯერ, სანამ არ მოდუნდები. ამოსუნთქვას გაატანე მოწევის სურვილი. </li>\n" +
            "          </ul>\n" +
            "          \n" +
            "          <p>მოწევის ძლიერი სურვილი გაჩნდება და გაქრება. გახსოვდეს, ქმედება მისი დამარცხებისათვის ყოველთვის ჯობს უმოქმედობას. უბრალოდ, არ მოწიო, არც-ერთი ნაფაზი!</p>\n" +
            "      </div>\n" +
            "    </div>\n" +
            "  </div>\n" +
            "  <div class=\"panel panel-default\">\n" +
            "    <div class=\"panel-heading\">\n" +
            "      <h4 class=\"panel-title\">\n" +
            "        <a data-toggle=\"collapse\" data-parent=\"#accordion\" href=\"#collapseThree\">3. თამბაქოსთვის თავის დანებება:</a>\n" +
            "      </h4>\n" +
            "    </div>\n" +
            "    <div id=\"collapseThree\" class=\"panel-collapse collapse\">\n" +
            "      <div class=\"panel-body\">\n" +
            "          <p>მწეველთა უმრავლესობამ იცის, თუ როგორ გრძნობს თავს, როდესაც არ ეწევა, მაგრამ არ იცის თუ რატომ გრძნობს თავს ასე. ნიკოტინი დამოკიდებულების გამომწვევი მთავარი ნივთიერებაა. მწეველთა დაახლოებით 80-90% ნიკოტინზეა დამოკიდებული. ნიკოტინი გავლენას ახდენს ორგანიზმზე‚ ასევე გონებაზე. დროთა განმავლობაში ორგანიზმი და გონება ნიკოტინს ეჩვევა.</p>\n" +
            "          \n" +
            "          <p>როდესაც მოწევას წყვეტ, ორგანიზმი უნდა შეეჩვიოს ნიკოტინის გარეშე არსებობას. ამან შეიძლება გამოიწვიოს არასასიამოვნო შეგრძნებები. ხშირად უარყოფითი სიმპტომები რამდენიმე დღე ან კვირა გრძელდება. ზოგიერთი ვერ უმკლავდება ამ შეგრძნებას და ხელახლა იწყებს მოწევას, რათა თავი უკეთ იგრძნოს. უმეტესად, ხელახლა მოწევას თავის დაენბებიდან ერთი კვირის განმავლობაში იწყებენ. ამ პერიოდში თამბაქოს მიტოვებით გამოწვეული შეგრძნებები ყველაზე ძლიერია.</p>\n" +
            "          \n" +
            "          <h2>რა სიმპტომებს იწვევს ნიკოტინის მიტოვება („ლომკა“)</h2>\n" +
            "          \n" +
            "          <p>შეგრძნებები ინდივიდუალურია, აქ ჩამოთვლილია ყველაზე გავრცელებული სიმპტომები:</p>\n" +
            "          <ul style=\"margin-top:-.5em\">\n" +
            "              <li>უხალისოდ ყოფნა, მოწყენილობა</li>\n" +
            "              <li>უძილობა</li>\n" +
            "              <li>გაღიზიანებულობა, სიბრაზე</li>\n" +
            "              <li>ნათლად მსჯელობის, ფიქრის, კონცენტრირების პრობლემები</li>\n" +
            "              <li>მოუსვენრობა</li>\n" +
            "              <li>გულისცემის შენელება</li>\n" +
            "              <li>შიმშილის გაძლიერებული გრძნობა ან წონის მატება</li>\n" +
            "          </ul>\n" +
            "          \n" +
            "          <p>მედიკამენტებისა და ქცევის ცვლილებების საშუალებით შესაძლებელია სიმპტომების მართვა. გახსოვდეთ, რომ სიმპტომები, ისევე როგორც მოწევის ძლიერი სურვილი, თანდათან ქრება. </p>\n" +
            "          \n" +
            "          <h2>რატომ მაქვს ისევ მოწევის სურვილი? მოწევის მიტოვებით გამოწვეული სხვა სიმპტომები უკვე რამდენიმე კვირაა რაც გაქრა.</h2>\n" +
            "          \n" +
            "          <p>მწეველთა უმრავლესობისათვის მოწევის სურვილი სხვა სიმპტომებზე უფრო ხანგრძლივია. ეს იმიტომ, რომ მოწევის სურვილს სხვადასხვა ფაქტორი განაპირობებს, როგორიცაა ადამიანები, ადგილები, საგნები, და სხვა. ამიტომ მნიშვნელოვანია, მათთან გასამკლავებლად სამოქმედო გეგმის მომზადება.</p>\n" +
            "          \n" +
            "          <h2>საშიშია ნიკოტინის მიტოვება („ლომკა“)?</h2>\n" +
            "          \n" +
            "          <p>მიუხედავად იმისა, რომ ნოკოტინის მიტოვება არასასიამოვნო შეგრძნებებს და სხვადასხვა სიმპტომებს იწვევს, იგი არ არის ჯანმრთელობისათვის საშიში. პირიქით, ნიკოტინის მიტოვება ჯანმრთელობის გაუმჯობესების საუკეთესო საშუალებაა. თამბაქოს მიტოვებით გამოწვეული ყველაზე არასასიამოვნო სიმპტომებიც კი ქრება დაახლოებით ერთი კვირის განმავლობაში. </p>\n" +
            "          \n" +
            "          <p>ხშირად უჩივიან გაძლიერებულ მოწყენილობას მოწევის შეწყვეტის შემდეგ. ეს ფაქტი განსაკუთრებით გასათვალისწინებელია, როდესაც მწეველს ოდესმე ქონია დეპრესია. თუ გაქვთ დეპრესია და თავს ძალიან მოწყენილად გრძნობთ, თქვენ გესაჭიროებათ დახმარება.</p>\n" +
            "          \n" +
            "          <h2>შეიძლება თამბაქოზე დამოკიდებულების მკურნალობის მედიკამენტების მიღება?</h2>\n" +
            "          \n" +
            "          <p>დიახ! მედიკამენტები აორმაგებენ მოწევის სამუდამოდ შეწყვეტის შესაძლებლობას. მიიღე ინფორმაცია ექიმისგან ან ფარმაცევტისაგან. გახსოვდეს, რომ მედიკამენტები დაგეხმარება, მაგრამ მხოლოდ მათი იმედი ნუ გექნება. მზად იყავი, რომ გექნება მოწევის სურვილი და მედიკამენტებთან ერთად გამოიყენე სხვა მეთოდები.</p>\n" +
            "          \n" +
            "          <p>აქ ჩამოთვლილია სხვადასხვა მედიკამენტი, რომელიც დაგეხმარება:</p>\n" +
            "          \n" +
            "          <h3>ნიკოტინჩანაცვლებითი საღეჭი რეზინა‚ პლასტირი‚ ინჰალატორი‚ სპრეი და ტაბლეტები</h3>\n" +
            "          \n" +
            "          <p>ნიკოტინჩანაცვლებითი საღეჭი რეზინა‚ პლასტირი‚ ინჰალატორი‚ სპრეი და ტაბლეტები ასევე ცნობილია ნიკოტინჩანაცვლებითი თერაპიის (nicotine replacement therapy NRT) სახელით. ნიკოტინჩანაცვლებითი თერაპია ხელს უწყობს ნიკოტინის მიტოვებით გამოწვეული სიმპტომების და მოწევის სურვილის შემცირებას. თუ ორსულად ხარ ან დაორსულებას აპირებ, ნიკოტინჩანაცვლებითი თერაპიის გამოყენებამდე გაესაუბრე ექიმს ან ფარმაცევტს.</p>\n" +
            "          \n" +
            "          <h3>ბუპროპიონის (SR) აბები</h3>\n" +
            "          \n" +
            "          <p>ბუპროპიონის (SR) აბები არ შეიცავს ნიკოტინს. ბუპროპიონი ხელს უწყობს ნიკოტინის მიტოვებით გამოწვეული სიმპტომების და მოწევის სურვილის შემცირებას. ზოგიერთი უჩივის უკუჩვენებებს, როგორიცაა ხახის სიმშრალე და უძილობა. გაესაუბრე ექიმს, ფარმაცევტს ამ მედიკამენტის შესახებ და მიიღე ექიმის დანიშნულების მიხედვით.</p>\n" +
            "          \n" +
            "          <p>მედიკამენტი არ უნდა გამოიყენონ:</p>\n" +
            "          <ul  style=\"margin-top:-.5em\">\n" +
            "              <li>ორსულებმა</li>\n" +
            "              <li>ეპილეფსიის დიაგნოზის მქონე პირებმა</li>\n" +
            "              <li>კვების დარღვევის მქონე პირებმა</li>\n" +
            "              <li>ლოთებმა</li>\n" +
            "          </ul>\n" +
            "          \n" +
            "          <h3>ვარენიკლინის აბები</h3>\n" +
            "          \n" +
            "          <p>ვარენიკლინი არ შეიცავს ნიკოტინს. ბუპროპიონი ხელს უწყობს ნიკოტინის მიტოვებით გამოწვეული სიმპტომებისა და მოწევის სურვილის შემცირებას; ასევე ახდენს მონიკოტინის მოქმედების ეფექტის ბლოკირებას, თუკი ადამიანი მოწევს. უკუჩვენებები უკავშირდება ისეთ პრობლემებს, როგორიცაა გულისრევა, უცნაური სიზმრები; უფრო იშვიათია  ხასიათის ცვლა, დეპრესია და სუიციდის აზრი.  გაესაუბრე ექიმს, ფარმაცევტს ამ მედიკამენტის შესახებ და მიიღე ექიმის დანიშნულების მიხედვით.</p>\n" +
            "          \n" +
            "          <p>მედიკამენტი არ უნდა გამოიყენონ:</p>\n" +
            "          <ul  style=\"margin-top:-.5em\">\n" +
            "              <li>თირკმლის პრობლემების მქონე პირებმა\n" +
            "              </li>\n" +
            "              <li>ორსულებმა, ვინც დაორსულებას აპირებს ან მეძუძურმა ქალებმა</li>\n" +
            "          </ul>\n" +
            "          \n" +
            "          <h2>ვფიქრობ ნიკოტინჩანაცვლებითი თერაპიის გამოყენებას. რა უნდა ვიცოდე?</h2>\n" +
            "          \n" +
            "          <ul>\n" +
            "              <li>გაესაუბრე ექიმს, ფარმაცევტს საღეჭი რეზინის, პლასტირის ან ნიკოტინჩანაცვლებითი თერაპიის სხვა სახეობების შესახებ. ზოგ შემთხვევაში, არ შეიძლება მისი გამოყენება ექიმის ჩაურევლად, მაგალითად ორსულობის დროს. </li>\n" +
            "          </ul>\n" +
            "          \n" +
            "          <ul>\n" +
            "              <li>იყავი მომთმენი. ნიკოტინჩანაცვლებიი თერაპიის სწორ გამოყენებას დრო სჭირდება. მიჰყევი ინსტრუქციებს და დაელოდე შედეგს. </li>\n" +
            "              <li>ერთდროულად ნუ გამოიყენებ თამბაქოს და ნიკოტინჩანაცვლებით თერაპიას. ერთი ან ორი სიგარეტის მოწევა მაშინ, როდესაც იყენებთ საღეჭ რეზინს, პლასტირს, ინჰალატორს, სპრეის ან ტაბლეტებს არ არის ჯანმრთელობისთვის სახიფათო, მაგრამ არ უწყობს ხელს საბოლოო მიზნის მითწევაში - იყოთ თამბაქოსგან თავისუფალი. ნიკოტინჩანაცვლებითი თერაპია გამოიყენე მაშინ, როდესაც მზად იქნები მოწევის შესაწყვეტად.</li>\n" +
            "              <li>მიიღე მედიკამენტები შესაბამისი დოზით. არ დაგავიწყდეს ან არ მიატოვო ნიკოტინჩანაცვლებითი თერაპია, როდესაც პირველად შეწყვეტ მოწევას. </li>\n" +
            "              <li>დოზა თანდათანობით შეამცირე, ერთბაშად ნუ შეწყვეტ მიღებას სანამ ამისთვის მზად არ იქნები. შეგიძლია ექიმთან ერთად შეიმუშაო შესაბამისი განრიგი.  </li>\n" +
            "              <li>შეინახე მედიკამენტის ნაწილი მისი გამოყენების შეწყვეტის შემდეგაც. ამ შემთხვევაში მზად იქნებით განსაკუთრებული შემთხვევებისათვის.</li>\n" +
            "              <li>საღეჭი რეზინის, ტაბლეტის ან ინჰალატორის გამოყენებიდან მხოლოდ ნახევარი საათის შემდეგ მიიღეთ მჟავე ტიპის სასმელი ან საკვები (მაგ. პომიდორი‚ ფორთოხალი‚ ლიმონი‚ გრეიფრუტი‚ ყავა‚ გაზიანი სასმელები). მჟავე სასმელი და საკვები ხელს უშლის საღეჭი რეზინის და ინჰალატორის მოქმედებას.</li>\n" +
            "          </ul>\n" +
            "      </div>\n" +
            "    </div>\n" +
            "  </div>\n" +
            "  <div class=\"panel panel-default\">\n" +
            "      <div class=\"panel-heading\">\n" +
            "          <h4 class=\"panel-title\">\n" +
            "              <a data-toggle=\"collapse\" data-parent=\"#accordion\" href=\"#collapseFour\">4.  ცდუნებები/ჩავარდნა:</a>\n" +
            "          </h4>\n" +
            "      </div>\n" +
            "      <div id=\"collapseFour\" class=\"panel-collapse collapse\">\n" +
            "          <div class=\"panel-body\">\n" +
            "              <p>ნუ დაყრით ფარ-ხმალს, თუ ერთ ან ორ ღერ სიგარეტს მოწევთ. ერთი სიგარეტის მოწევა უკეთესია ვიდრე ერთ კოლოფის. ამ შეცდომას ნუ გამოიყენებთ მიზეზად, რომ კვლავ დაიწყოთ მოწევა. მწეველთა უმრავლესობა რამდენიმე ცდის შემდეგ აღწევს შედეგს და ხდება თამბაქოსგან თავისუფალი. როგორც წესი, ამგვარი ჩავარდნა ხდება მოწევის შეწყვეტიდან პირველი სამი თვის განმვალობაში. </p>\n" +
            "              \n" +
            "              <p>აი, რისი გაკეთება შეგიძლიათ:</p>\n" +
            "              \n" +
            "              <ul>\n" +
            "                  <li>გაანალიზე, რომ შეცდი. ადგილი ქონდა უბრალოდ მცირე რეგრესს. ამით ხელახლა არ ხდები მწეველი. </li>\n" +
            "                  <li>ძალიან ნუ გააკრიტიკებ საკუთარ თავს. ეს არ ნიშნავს, რომ დამარცხდი და არ შეგიძლია მოწევის სამუდამოდ შეწყვეტა.</li>\n" +
            "                  <li>ძალიან მარტივად ნუ შეხედავ ჩავარდნას. ნუ იფიქრებ \"არა უშავს. შემიძლია მთელი პაკეტიც მოვწიო\". აუცილებელია მაშინვე არა-მწეველ გადაწყვეტილებას დაუბრუნდე. გახსოვდე საკუთარი მიზანი - იყო თამბაქოსგან თავისუფალი, არცერთი ნაფაზი.</li>\n" +
            "                  <li>იფიქრე რა კარგ დროს ატარებთ მოწევის გარეშე. ეცადე, გაიუმჯობესო უნარები, რომლებიც გეხმარება თავიდან აიცილო ცდუნება.</li>\n" +
            "                  <li>გაანალიზე მაპროვოცირებელი მიზეზი. რამ გაიძულა, რომ მოგეწია? მოიფიქრე, როგორ უნდა გაუმკლავდე ამ მიზეზს მომავალში. </li>\n" +
            "                  <li>ისწავლე საკუთარი გამოცდილებიდან. ყველაზე მეტად რამ შეგიწყო ხელი, რომ არ მოგეწია? აუცილებლად გაიმეორე საჭიროების შემთხვევაში.</li>\n" +
            "                  <li>იყენებ თამბაქოზე დამოკიდებულების მკურნალობის მედიკამენტებს? ნუ შეწყვეტ მის მიღებას ერთი ან ორი სიგარეტის მოწევის გამო.</li>\n" +
            "                  <li>გაეცანი ინფორმაციას თამბაქოზე დამოკიდებულების მკურნალობის მედიკამენტებისა და სხვა საშუალებების შესახებ. </li>\n" +
            "                  <li>გაესაუბრე ექიმს ან ჯანდაცვის სხვა მუშაკს. მათ შეუძლიათ გაგიზარდონ მოტივაცია.</li>\n" +
            "                  <li>თხოვე დახმარება მეგობრებს, ოჯახის წევრებს, თანამშრომლებს. არ არის საჭირო განმარტოება!</li>\n" +
            "              </ul>\n" +
            "          </div>\n" +
            "      </div>\n" +
            "  </div>\n" +
            "  <div class=\"panel panel-default\">\n" +
            "      <div class=\"panel-heading\">\n" +
            "          <h4 class=\"panel-title\">\n" +
            "              <a data-toggle=\"collapse\" data-parent=\"#accordion\" href=\"#collapseFive\">5. თამბაქოსგან თავისუფლად ყოფნა:</a>\n" +
            "          </h4>\n" +
            "      </div>\n" +
            "      <div id=\"collapseFive\" class=\"panel-collapse collapse\">\n" +
            "          <div class=\"panel-body\">\n" +
            "              <p>მოწევის შეწყვეტას და თამბაქოსგან თავისუფლად დარჩენას გამბედაობა სჭირდება. უნდა იამაყო იმით, რასაც მიაღწიე. ეხლა, როცა მოწევა შეწყვიტე, უნდა იფიქრო იმაზე, რომ არ მოწიო დიდი ხნის განმავლობაში.</p>\n" +
            "              \n" +
            "              <p>აი, 5 რჩევა არამწეველის სტატუსის შესანარჩუნებლად:</p>\n" +
            "              \n" +
            "              <h2>1. ნუ მოადუნეთ ყურადღებას</h2>\n" +
            "              \n" +
            "              <p>ორგანიზმი შეიცვალა, რაც მოწევა დაიწყე. გარკვეული ადამიანები, ადგილები, ნივთები, სიტუაციები მოწევის დიდ სურვილს გამოიწვევს მოწევის შეწყვეტიდან წლების შემდეგაც კი. ამიტომ, აუცილებელია, რომ არ მოწიო, არც-ერთი ნაფაზი, არ აქვს მნიშვნელობა რამდენი ხნის წინათ შეწყვიტე მოწევა.</p>\n" +
            "              \n" +
            "              <p>მოწევის შეწყვეტის შემდეგ, მოწევის სურვილი ხშირად ერთიდაიმავე დროს ან ერთიდაიმავე ადგილას ჩნდება. გაანალიზე მოწევის სურვილის გამომწვევი მიზეზები, რაომ მათი დამარცხება შეძლო.</p>\n" +
            "              \n" +
            "              <h2>2. შეებრძოლე სურვილს</h2>\n" +
            "              \n" +
            "              <p>რაც უფრო ხშირად გაუძლებ სურვილებს, მით უფრო ადვილად გაქრება მოწევის სურვილი. გაუძელი ამ სურვილს, გამოიყენე მეთოდები, რომელიც ამ სურვილის უარყოფაში გეხმარება (მაგ. გასეირნება, ღრმად ჩასუნთქვა, და სხვა).</p>\n" +
            "              \n" +
            "              <h2>3. იყავი ოპტიმისტი</h2>\n" +
            "              \n" +
            "              <p>ნუ დასჯი საკუთარ თავს, თუ რამდენიმე კვირის შემდეგ ერთ სიგარეტს მოწევ. ნუ იფიქრებ, რომ მოწევა ან სრულად უნდა შეწყვიტო ან მოწიო; ყოველდღე თითო ნაბიჯი გადადგით, მოწევის შეწყვეტის პროცესი გამოცდილების დაგროვებას უწყობს ხელს.</p>\n" +
            "              \n" +
            "              <h2>4. დაასაჩუქრე საკუთარი თავი </h2>\n" +
            "              \n" +
            "              <p>მოწევის შეწყვეტა რთულია და თამბაქოსგან თავისუფლად ყოფნა მიღწევაა, ამიტომ დაასაჩუქრე საკუთარი თავი ასეთი მიღწევისათვის. მას შემდეგ, რაც აღარ ყიდულობ სიგარეტს და ფულს ზოგავ, გაუკეთე საკუთარ თავს საჩუქარი. შეიძლება უფასოდაც დაასაჩუქრო საკუთარი თავი! გაისეირნე და ისიამოვნე სუფთა ჰაერით, ახლა, როცა მას უკეთ ისუნთქავთ ან მეგობართან ერთად წადი კინოში.</p>\n" +
            "              \n" +
            "              <h2>5. დაიხმარე სხვები</h2>\n" +
            "              \n" +
            "              <p>მიუხედავად იმისა, რომ გარკვეული ხანია თამბაქოსგან თავისუფალი ხარ, შეიძლება კვლავ გაგიჩნდეს მოწევის სურვილი. როდესაც ეს მოხდებსა, ნუ შეგრცხვებათ დახმარებისთვის მიაკითხო მათ, ვინც ადრე გეხმარებოდა. ეს ნორმალურია და არ მიანიშნებს თქვენს სისუსტეზე. ხშირად ამ თემებზე საუბარი ხელს უწყობს დარჩე თამბაქოსგან თავისუფალი. </p>\n" +
            "              \n" +
            "              <p>გახსოვდეს, რომ მოწევის შეწყვეტა ყოველდღიური პროცესია. იზეიმე მიღწევები (დიდი თუ პატარა); შენ ეს დაიმსახურე!</p>\n" +
            "          </div>\n" +
            "      </div>\n" +
            "  </div>\n" +
            "</div>\n" +
            "</div>\n" +
            "</body>\n" +
            "</html>";
}
